In [1]:
### Import pandas lib

In [2]:
import pandas as pd
import numpy as pn

In [3]:
from numpy.random import randn

In [8]:
labels = ["A","B","C","D","E"]
cols = ["X","W","Y","Z"]
df = pd.DataFrame(randn(5,4), index=labels, columns=cols)

In [9]:
df

          X         W         Y         Z
A -0.895295  1.050981 -1.014551  0.789658
B -1.040583  0.332350  0.530872 -0.944379
C  0.781520  0.500381  0.278534  0.671250
D  1.466806  0.546867  0.712756 -0.209334
E  0.806697 -0.457673  0.468977  2.066548

In [13]:
df[["X","Z"]]

          X         Z
A -0.895295  0.789658
B -1.040583 -0.944379
C  0.781520  0.671250
D  1.466806 -0.209334
E  0.806697  2.066548

In [14]:
type(df["Z"])

pandas.core.series.Series

In [15]:
### adding new columns to dataframe

In [16]:
df["T"] = [1,23,32,45,53]

In [17]:
df

          X         W         Y         Z   T
A -0.895295  1.050981 -1.014551  0.789658   1
B -1.040583  0.332350  0.530872 -0.944379  23
C  0.781520  0.500381  0.278534  0.671250  32
D  1.466806  0.546867  0.712756 -0.209334  45
E  0.806697 -0.457673  0.468977  2.066548  53

In [18]:
### remove columns from dataframe

In [19]:
df.drop("T", axis=1)

          X         W         Y         Z
A -0.895295  1.050981 -1.014551  0.789658
B -1.040583  0.332350  0.530872 -0.944379
C  0.781520  0.500381  0.278534  0.671250
D  1.466806  0.546867  0.712756 -0.209334
E  0.806697 -0.457673  0.468977  2.066548

In [20]:
df

          X         W         Y         Z   T
A -0.895295  1.050981 -1.014551  0.789658   1
B -1.040583  0.332350  0.530872 -0.944379  23
C  0.781520  0.500381  0.278534  0.671250  32
D  1.466806  0.546867  0.712756 -0.209334  45
E  0.806697 -0.457673  0.468977  2.066548  53

In [21]:
df.drop("T", axis=1, inplace=True)

In [22]:
df

          X         W         Y         Z
A -0.895295  1.050981 -1.014551  0.789658
B -1.040583  0.332350  0.530872 -0.944379
C  0.781520  0.500381  0.278534  0.671250
D  1.466806  0.546867  0.712756 -0.209334
E  0.806697 -0.457673  0.468977  2.066548

In [23]:
df.iloc[0]

X   -0.895295
W    1.050981
Y   -1.014551
Z    0.789658
Name: A, dtype: float64

In [25]:
### Selecting cell from row A, column Z

In [26]:
df.loc["A","Z"]

0.7896582327312367

In [27]:
df

          X         W         Y         Z
A -0.895295  1.050981 -1.014551  0.789658
B -1.040583  0.332350  0.530872 -0.944379
C  0.781520  0.500381  0.278534  0.671250
D  1.466806  0.546867  0.712756 -0.209334
E  0.806697 -0.457673  0.468977  2.066548

In [29]:
### Selecting by conditional operation

In [31]:
fil =(df["X"]>0)
df[fil]

          X         W         Y         Z
C  0.781520  0.500381  0.278534  0.671250
D  1.466806  0.546867  0.712756 -0.209334
E  0.806697 -0.457673  0.468977  2.066548